[{"id":1776361050,"name":"A Green Peas Soup, without Meat","ingredients":["10 cups fresh or frozen peas or petits pois (small, young green peas), divided","6 cups water, divided","1 1/2 teaspoons salt","1/4 teaspoon ground black pepper","1/2 teaspoon ground mace","2 cloves","2 teaspoons dried thyme","1 teaspoon dried marjoram","4 tablespoons unsalted butter","3 to 4 green onions, trimmed and sliced crosswise into 1/2-inch pieces","1/4 pound fresh baby spinach, coarsely chopped","2 teaspoons minced fresh mint","3 tablespoons all-purpose flour","Diced toast for garnish (optional)","Shredded fresh calendula blossoms for garnish (optional)"],"preparation":["1. Put 8 cups of the peas and 4 cups of the water in a large saucepan or Dutch oven. Add the salt, pepper, mace, cloves, thyme, and marjoram, cover, and bring to a boil. Reduce the heat, and simmer for about 45 minutes, until the peas are very tender.","2. Drain the peas, reserving the cooking liquid in the sauceupan. Puree the peas in a food processor or with a food mill. If using a food mill, discard the skins. Press the puree through a sieve into the reserved liquid, stirring to combine thoroughly. Cover and set aside to keep warm.","3. Combine the remaining 2 cups of peas with the remaining 2 cups of water in a medium saucepan. Cover and bring to a boil. Reduce the heat and simmer for 20 to 25 minutes, until the peas are just tender.","4. While the second batch of peas is cooking, melt the butter in a sauté pan. Add the green onions, and sauté for about 2 minutes. Add the spinach and mint and stir together, cooking until the spinach has just wilted. Blend in the flour, and cook for about 1 minute.","5. Drain the peas, reserving the cooking liquid, and stir the peas into the warm soup along with the spinach mixture. Heat until it begins to simmer, adding the reserved pea-cooking liquid—a little at a time—if the soup is too thick. Season with additional salt and pepper, if necessary.","6. Pour the soup into a tureen, and garnish with diced toast and shredded calendula blossoms, if desired."],"source":"www.epicurious.com","tags":["Soup/Stew","Food Processor","Leafy Green","Herb","Vegetable","Vegetarian","Dinner","Mint","Spinach","Legume","Pea","Spring","Boil","Pescatarian","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added","Kosher"]},{"id":30216865,"name":"Ah-So-Easy Ramen Peanut Pasta","ingredients":["1/3 cup peanut butter","3 tablespoons vegetable oil","3 tablespoons vinegar","2 tablespoons soy sauce","1 clove garlic, minced","1 teaspoon white sugar","1/4 teaspoon cayenne pepper, or to taste","4 (3 ounce) packages ramen noodle soup (seasoning packets reserved for another use)","1/2 small cucumber, peeled and cut into matchsticks","1 green onion, thinly sliced","1/4 cup chopped cilantro","2 tablespoons chopped salted peanuts"],"preparation":["Stir peanut butter, vegetable oil, vinegar, soy sauce, garlic, sugar, and cayenne pepper together in a bowl until smooth.","Bring a pot of water to a boil. Cook ramen noodles in boiling water until tender yet firm to the bit, about 3 minutes; drain and transfer noodles to a bowl. Pour peanut butter sauce over the noodles and toss to coat. Stir cucumber and green onion into the noodle mixture; garnish with cilantro and peanuts."],"source":"allrecipes.com","tags":[]},{"id":2859709543,"name":"A Gooey, Decadent Chocolate Cake","ingredients":["2 1/2 cups cake flour","1 1/2 teaspoons baking soda","1 teaspoon salt","1 1/2 sticks unsalted butter, at room temperature","2 cups granulated sugar","3 1/2 ounces dark chocolate, melted and cooled","1 teaspoon vanilla extract","2 eggs","1 1/2 cups cold water","Raspberry liqueur, such as Chambord, for drizzling","Nonstick cooking spray","Chocolate Chip Buttercream, recipe follows","Dark chocolate shavings, for decoration","3 cups powdered sugar","7 tablespoons hot water","4 ounces dark chocolate, melted and cooled","2 teaspoons vanilla extract","1/2 stick unsalted butter, at room temperature","1/4 cup semisweet dark chocolate, finely chopped"],"preparation":["Position an oven rack in the center of the oven and preheat the oven to 350 degrees F.","In a large bowl, sift together the flour, baking soda and salt; set aside. In the bowl of an electric mixer, cream the butter and granulated sugar until light and fluffy. Add the cooled chocolate and vanilla and beat for 3 minutes to incorporate. Beat in the eggs one at a time. Scrape down the sides of the bowl and beat for another 3 minutes. Gradually mix in the dry ingredients in three batches, alternating with the cold water. Beat for 1 minute after each addition to incorporate the ingredients. Mix until the batter is smooth.","Coat two 9-inch round cake pans with nonstick cooking spray. Cut 2 circles of parchment paper to fit the pan bottoms and place them inside the pans; then spray the paper for added non-stick insurance. Pour the batter into the prepared pans and smooth the surface with a spatula; the pans should be two-thirds full. Bake for 30 to 35 minutes. The cake is cooked when a toothpick inserted in the center comes out clean and the cake springs back when touched. Leave to cool for 40 minutes.","Turn the cakes out of the pans and remove the paper. Drizzle them with a few tablespoons of raspberry liqueur. With a metal spatula, spread 1/2 cup Chocolate Chip Buttercream on top of one of the layers. Start in the center and work your way out. Carefully place the second layer on top. Smooth the sides with buttercream, and then spread the rest over the top so that the cake is completely covered. Refrigerate for 5 minutes before decorating or cutting.","With a large knife, scrape some shavings from a block of dark chocolate. Scatter the shavings over the cake.","In the bowl of an electric mixer, dissolve the powdered sugar and water at low speed. Beat in the dark chocolate and vanilla. Add the butter gradually in small bits. Mix until everything is completely incorporated. Using a spatula, fold in the chopped chocolate and give a final quick spin."],"source":"www.foodnetwork.com","tags":["Chocolate Cake","Cake","Chocolate","Baking","Dessert","Mixer Recipes","Dairy Recipes","Fruit","Raspberry Recipes"]},{"id":3027257713,"name":"A Plus Carrot Cake","ingredients":["2 cups all-purpose flour","2 teaspoons baking powder","1 teaspoon baking soda","1/2 teaspoon salt","1 teaspoon ground cinnamon","1/2 teaspoon ground nutmeg","1/2 teaspoon allspice","4 eggs","2 cups white sugar","2 teaspoons vanilla extract","1 1/4 cups vegetable oil","2 cups grated carrots","1 (20 ounce) can crushed pineapple, drained","1/2 cup sweetened flaked coconut","1 cup chopped walnuts","1 cup raisins"],"preparation":["Preheat the oven to 350 degrees F (175 degrees C).  Coat a 10x15x2 inch baking dish or 10 inch Bundt pan with cooking spray.","In a medium bowl, stir together the flour, baking powder, baking soda, salt, cinnamon and nutmeg. Set aside. In a separate larger bowl, mix together the eggs, sugar and vanilla by hand. Stir in the oil; the mixture should resemble pudding. Gradually stir in the dry ingredients, then fold in the carrots, pineapple coconut, walnuts and raisins. Pour the batter into the prepared pan, and spread evenly.","Bake for 55 to 60 minutes in the preheated oven, or until a small knife inserted into the cake comes out clean."],"source":"allrecipes.com","tags":[]},{"id":2252809488,"name":"Cucumber-Basil Agua Fresca","ingredients":["2 large English hothouse cucumbers","1/2 cup fresh lime juice","1/4 cup (packed) basil leaves","1/4 cup sugar or agave syrup, plus more to taste"],"preparation":["Slice a few thin slices of cucumber; reserve for garnish. Peel and coarsely chop remaining cucumber.","Purée chopped cucumber, lime juice, basil, 1/4 cup sugar, and 2 cups water in a food processor until very smooth. Strain into a pitcher and add 2 cups water, adding more sugar or water if needed, then chill until ready to serve. Add reserved cucumber slices just before serving."],"source":"www.epicurious.com","tags":["Non-Alcoholic","Kid-Friendly","Quick & Easy","Basil","Cucumber","Summer","Lime Juice","Drink"]}]