[{"id":1406303278,"name":"Imperial Hotel Fizz","ingredients":["1 1/2 ounces whiskey","3/4 ounce light rum","1 teaspoon lemon juice","1 1/2 tablespoons lime juice","1 teaspoon superfine sugar","3 or 4 ice cubes","Club soda"],"preparation":["Combine all ingredients except the soda in a cocktail shaker and shake vigorously. Strain into a highball glass and fill with soda."],"source":"www.epicurious.com","tags":["Fruit Juice","Rum","Alcoholic","Cocktail Party","Cocktail","Lemon","Lime","Whiskey","Engagement Party","House & Garden","Drink"]},{"id":1590713186,"name":"Aguachile de Camarón (Shrimp Cooked in Lime and Chile)","ingredients":["1 English cucumber, peeled","1 pound fresh, head-on jumbo shrimp","1 teaspoon kosher salt, plus more to taste","1 cup freshly squeezed lime juice","1/4 cup extra-virgin olive oil","2 to 3 fresh serrano chiles, sliced"],"preparation":["Cut the cucumber into thin rectangular slices, about 3 inches long, and divide among 4 small plates.","Peel, devein, and butterfly the shrimp, leaving the tail intact but discarding the head. Arrange the shrimp on top of the cucumber slices, sprinkle with salt, cover with plastic wrap, and refrigerate for at least 1 1/2 hours.","In a blender, combine the lime juice, olive oil, chiles, and 1/4 cup of cold water. Process until smooth then season to taste with salt.","Just before serving, drizzle the shrimp with the lime-chile sauce and serve immediately."],"source":"www.epicurious.com","tags":["Shellfish","No-Cook","Lunch","Seafood","Shrimp","Cucumber","Healthy","Lime Juice","Chile Pepper","Sugar Conscious","Pescatarian","Paleo","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"]},{"id":749646659,"name":"A Fruitcake to Love","ingredients":["Nonstick vegetable oil spray","1 1/4 cups chopped pitted Medjool dates","3/4 cup chopped candied orange peel","1/3 cup chopped dried Mission figs","10 oil-cured olives","2 tablespoons Nocello (walnut liqueur) or Frangelico (hazelnut liqueur)","2 tablespoons water","1 3/4 cups all purpose flour","2 teaspoons baking powder","1 teaspoon coarse kosher salt","1/2 teaspoon ground nutmeg","1/2 teaspoon ground cloves","1/4 teaspoon ground cinnamon","1/2 cup plain whole-milk yogurt","2 tablespoons olive oil","3/4 cup (11/2 sticks) unsalted butter, room temperature","3/4 cup sugar","3 large eggs","2 cups coarsely chopped walnuts","3/4 cup shelled unsalted natural pistachios"],"preparation":["Position rack in center of oven and preheat to 350°F. Butter two 8 1/2x4 1/2x2 1/2-inch metal loaf pans. Spray with nonstick spray; dust with flour. Mix dates and next 5 ingredients in medium bowl. Let stand 15 minutes. Sift flour, baking powder, coarse kosher salt, nutmeg, cloves, and cinnamon into another medium bowl.","Whisk yogurt and oil in small bowl. Using electric mixer, beat butter and sugar in large bowl until blended. Add eggs 1 at a time, beating well after each addition. Beat in flour mixture in 3 additions alternately with yogurt mixture in 2 additions, beginning and ending with flour mixture. Stir in walnuts, pistachios, and dried-fruit mixture. Divide batter between prepared pans. Smooth tops.","Bake cakes until tester inserted into centers comes out clean and cakes begin to pull away from sides of pans, about 50 minutes. Cool in pans 30 minutes. Turn cakes out onto racks. Cool completely. DO AHEAD: Can be made up to 1 month ahead. Wrap in foil, then enclose in resealable plastic bags. Store at room temperature up to 3 days or freeze up to 1 month. Thaw frozen cakes in refrigerator. Bring to room temperature before serving."],"source":"www.epicurious.com","tags":["Cake","Olive","Dessert","Bake","Christmas","Yogurt","High Fiber","Dried Fruit","Date","Fig","Pistachio","Walnut","Spice","Winter","Kidney Friendly","Vegetarian","Pescatarian","Peanut Free","Soy Free","Kosher"]},{"id":347205031,"name":"3-Ingredient Banana Petit Fours","ingredients":["2 bananas","1/2 cup peanut butter or chocolate-hazelnut spread, such as Nutella","1 cup trail mix or freeze-dried raspberries, crushed"],"preparation":["Cut the bananas into 1 1/2-inch pieces. Spread each piece with about 1/2 teaspoon of the peanut butter or chocolate-hazelnut spread, and dip in your favorite trail mix or crushed freeze-dried raspberries."],"source":"www.foodnetwork.com","tags":["Fruit","Raspberry Recipes","Banana","Peanut Butter Fudge","Dessert","Snack"]},{"id":1952928634,"name":"Instant-Pot Ancho Chile Sauce","ingredients":["2 ounces dried ancho chiles (3 to 5 chiles)","2 garlic cloves, lightly smashed","1 1/2 cups water","2 teaspoons kosher salt","1 1/2 teaspoons sugar","1/2 teaspoon dried oregano","1/2 teaspoon ground cumin","2 tablespoons apple cider vinegar"],"preparation":["Pull or cut off the stems from the chiles and remove as many seeds as possible. Put the chiles in the Instant Pot. Be sure to thoroughly wash your hands after handling the chiles.","Add the garlic, water, salt, sugar, oregano, and cumin to the Instant Pot. Lock the lid into place. Select Manual; adjust the pressure to High and the time to 8 minutes. After cooking, naturally release the pressure for 5 minutes, then quick release any remaining pressure. Unlock and remove the lid.","Pour the sauce into a blender. Add the vinegar and blend until smooth, being careful to hold the lid on. Use immediately, or store in a covered container in the refrigerator for up to a week or in the freezer for up to a month."],"source":"www.epicurious.com","tags":["Instant Pot","Pressure Cooker","Sauce","Chile Pepper","Hot Pepper","Cumin","Oregano","Vinegar","Quick & Easy","Condiment/Spread"]},{"id":2804099629,"name":"3-Ingredient Sausage Dinner With Lentils and Fennel","ingredients":["2 medium fennel bulbs with fronds","6 tablespoons olive oil, divided, plus more for serving","2 1/2 teaspoons kosher salt, divided","1/2 teaspoon freshly ground black pepper, divided","1 cup dried lentils (preferably French green lentils; about 7 ounces)","4 sweet Italian sausages"],"preparation":["Preheat oven to 400°F. Finely chop half of 1 fennel bulb. Chop 2 Tbsp. fronds, transfer to a small bowl, and set aside.","Heat 3 Tbsp. oil in a 3–4-qt. heavy saucepan over medium. Cook chopped fennel, 1/2 tsp. salt, and 1/4 tsp. pepper, stirring, until softened, about 5 minutes.","Add lentils, 1 tsp. salt, and 4 1/2 cups water, bring to a boil, then reduce heat and simmer, uncovered, until lentils are just tender but not falling apart, 15–25 minutes.","Meanwhile, cut remaining 1 1/2 fennel bulbs into 1\" wedges.","Heat 1 Tbsp. oil in a large ovenproof skillet over medium-high. Cook sausages, turning occasionally, until golden brown on all sides but still undercooked, about 8 minutes. Transfer sausages to a plate.","Heat 2 Tbsp. oil in same skillet over medium-high. Cook fennel wedges and remaining 1 tsp. salt and 1/4 tsp. pepper, stirring, until golden brown on both sides, about 5 minutes. Nestle sausages among fennel wedges, then transfer skillet to oven and roast until sausages are firm and fully cooked through, about 8 minutes more.","Cut sausages diagonally into 1/2\"-thick slices. Divide lentils among bowls, then top with sliced sausage, roasted fennel, a drizzle of oil, and reserved fennel fronds."],"source":"www.epicurious.com","tags":["3-Ingredient Recipes","Sausage","Dinner","Lentil","Fennel","Spring"]},{"id":3447978454,"name":"6 Hour Tri-tip Marinade","ingredients":["1 cup lemon juice","1 cup soybean oil","1/2 cup white sugar","1/2 cup soy sauce","1/2 cup black pepper","1/2 cup garlic salt (recommended: Lawry's)","1/2 cup chopped garlic","1/2 cup chopped dried onions","2 (4-pound) tri-tips, trimmed"],"preparation":["To make the marinade, mix all of the ingredients except for the beef in a large mixing bowl. Place the trimmed tri-tips in a plastic container and pour the marinade over. Let stand in the refrigerator for at least 6 hours.","Heat grill to medium temperature.","Place tri-tips on grill at a 45 degree angle to establish grill marks and cook about 35 minutes, or until cooked to desired doneness. Remove the tri-tips from the grill and let rest about 2 to 5 minutes before slicing. Serve with your favorite side dishes."],"source":"www.foodnetwork.com","tags":["Make Ahead","American","Holiday","Memorial Day Recipes","Beef","Meat","Main Dish Recipes","Lunch","4th of July","Outdoor Party","Recipes for Parties","Marinating Recipes","Grilling"]},{"id":884205990,"name":"30-Minute Rice Pudding with Dried Fruit","ingredients":["1 cup arborio or medium-grain rice","5 cups whole milk","1/4 cup raisins","1/2 teaspoon grated orange peel","1/4 vanilla bean, split lengthwise","4 large egg yolks","1/2 cup sugar"],"preparation":["Place rice in strainer and rinse under cold running water until water runs clear. Place rice, milk, raisins, and orange peel in large saucepan. Scrape seeds from vanilla bean into pan; add bean. Bring rice mixture to simmer over medium heat, stirring occasionally. Reduce heat to lowest possible temperature, cover, and simmer, stirring occasionally, until rice is tender, about 23 minutes. Remove from heat. Add egg yolks; stir until thickened, about 1 minute. Stir in sugar.","Divide pudding among eight 3/4-cup ramekins or custard cups. Chill until cold, about 3 hours. DO AHEAD Can be made 1 day ahead. Cover and keep chilled."],"source":"www.epicurious.com","tags":["Milk/Cream","Citrus","Dairy","Egg","Rice","Dessert","Freeze/Chill","Quick & Easy","Dried Fruit","Chill","Vegetarian","Pescatarian","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","Kosher"]},{"id":1776361050,"name":"A Green Peas Soup, without Meat","ingredients":["10 cups fresh or frozen peas or petits pois (small, young green peas), divided","6 cups water, divided","1 1/2 teaspoons salt","1/4 teaspoon ground black pepper","1/2 teaspoon ground mace","2 cloves","2 teaspoons dried thyme","1 teaspoon dried marjoram","4 tablespoons unsalted butter","3 to 4 green onions, trimmed and sliced crosswise into 1/2-inch pieces","1/4 pound fresh baby spinach, coarsely chopped","2 teaspoons minced fresh mint","3 tablespoons all-purpose flour","Diced toast for garnish (optional)","Shredded fresh calendula blossoms for garnish (optional)"],"preparation":["1. Put 8 cups of the peas and 4 cups of the water in a large saucepan or Dutch oven. Add the salt, pepper, mace, cloves, thyme, and marjoram, cover, and bring to a boil. Reduce the heat, and simmer for about 45 minutes, until the peas are very tender.","2. Drain the peas, reserving the cooking liquid in the sauceupan. Puree the peas in a food processor or with a food mill. If using a food mill, discard the skins. Press the puree through a sieve into the reserved liquid, stirring to combine thoroughly. Cover and set aside to keep warm.","3. Combine the remaining 2 cups of peas with the remaining 2 cups of water in a medium saucepan. Cover and bring to a boil. Reduce the heat and simmer for 20 to 25 minutes, until the peas are just tender.","4. While the second batch of peas is cooking, melt the butter in a sauté pan. Add the green onions, and sauté for about 2 minutes. Add the spinach and mint and stir together, cooking until the spinach has just wilted. Blend in the flour, and cook for about 1 minute.","5. Drain the peas, reserving the cooking liquid, and stir the peas into the warm soup along with the spinach mixture. Heat until it begins to simmer, adding the reserved pea-cooking liquid—a little at a time—if the soup is too thick. Season with additional salt and pepper, if necessary.","6. Pour the soup into a tureen, and garnish with diced toast and shredded calendula blossoms, if desired."],"source":"www.epicurious.com","tags":["Soup/Stew","Food Processor","Leafy Green","Herb","Vegetable","Vegetarian","Dinner","Mint","Spinach","Legume","Pea","Spring","Boil","Pescatarian","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added","Kosher"]},{"id":447352882,"name":"1989 Chocolate Raspberry Almond Torte","ingredients":["1/2 cup blanched almonds, toasted lightly","2 ounces unsweetened chocolate","2 tablespoons unsalted butter","2 large eggs","1 cup sugar","1 tablespoon framboise or other raspberry brandy","3/4 cup all-purpose flour","1 teaspoon double-acting baking powder","1/2 teaspoon salt","1 cup raspberries plus additional for garnish and as an accompaniment","1/3 cup raspberry jam","1 tablespoon sugar","1/4 cup heavy cream","6 ounces fine-quality bittersweet chocolate, chopped","lemon leaves (available at most florists) for garnish"],"preparation":["In a food processor grind the almonds, scraping the bowl occasionally, for 5 minutes, or until they are the consistency of a nut butter, and reserve the mixture. In a bowl set over a saucepan of barely simmering water melt the chocolate and the butter, stirring occasionally, and remove the bowl from the pan. In the large bowl of an electric mixer beat the eggs until they are pale, add the sugar gradually, beating, and beat the mixture until it is very thick and pale. Beat in the chocolate mixture, the framboise, and the reserved almond butter and beat the mixture until it is combined well. Into the bowl sift together the flour, the baking powder, and the salt, beat the mixture until it is combined well, and fold in 1 cup of the raspberries gently. Turn the mixture into a well-buttered 8 1/2-inch springform pan, spreading it evenly and smoothing the top, and bake the torte in the middle of a preheated 350°F. oven for 40 to 45 minutes, or until a tester comes out clean. let the torte cool in the pan on a rack and remove the side of the pan.","In a small heavy saucepan combine the jam and the sugar, bring the mixture to a boil, stirring, and boil it, stirring, for 3 minutes. Force the mixture through a fine sieve into a small bowl, pressing hard on the seeds, and discard the seeds.","Invert the torte onto the rack, set over wax paper, remove the bottom of the pan, and spread the glaze on the top and side of the torte. Let the torte stand at room temperature for 2 hours or chill it for 30 minutes, or until the glaze is set. The torte may be prepared up to this point 1 day in advance and kept on the rack, covered with an inverted bowl, at room temperature.","In a small heavy saucepan bring the cream to a boil and remove the pan from the heat. Stir in the chocolate, stirring until the mixture is smooth, and let the ganache cool for 3 minutes.","Pour the ganache over the torte, smoothing it with a spatula and letting the excess drip down the side, and let the torte stand for 1 hour, or until the ganache is set. Transfer the torte carefully to a serving plate, garnish it with some of the additional raspberries and some of the lemon leaves, and serve the remaining raspberries, garnished with the remaining lemon leaves, separately."],"source":"www.epicurious.com","tags":["Cake","Milk/Cream","Chocolate","Egg","Dessert","Raspberry","Almond","Gourmet"]},{"id":2373375143,"name":"Almond and Chocolate Dacquoise with Cranberry Sauce","ingredients":["6 large egg whites","3/4 teaspoon cream of tartar","1/4 teaspoon salt","1 1/2 cups sugar","1 teaspoon vanilla","1 cup whole almonds, toasted, cooled completely, and ground fine","1 cup fresh or unthawed frozen cranberries, each berry halved","1/2 cup raspberry preserves","1/3 cup sugar","1/3 cup water","2 tablespoons fresh lemon juice","4 1/2 ounces fine-quality bittersweet chocolate (not unsweetened), chopped","2 cups heavy cream","2 tablespoons sugar","1/2 teaspoon vanilla","chocolate holly leaves and cranberries coated lightly in honey and rolled in sugar","4 ounces fine-quality bittersweet chocolate (not unsweetened) chopped","15 fresh holly leaves or small lemon leaves, washed well and patted dry","*Although holly leaves are non-toxic holly berries are poisonous and should be kept away from food."],"preparation":["Preheat oven to 325°F. Line 2 baking sheets with parchment paper and, using an 8-inch round cake pan as a guide, trace 3 circles on parchment (2 on one sheet and 1 on other). Turn parchment over (circles will show through paper).","In a large bowl with an electric mixer beat whites with cream of tartar and salt until they hold soft peaks. Add sugar all at once and vanilla and beat until meringue holds stiff glossy peaks. Fold in almonds gently but thoroughly and divide meringue evenly among parchment circles, spreading to fill in circles.","Bake meringue layers in upper and lower thirds of oven, switching position of sheets halfway through baking, 1 hour, or until firm and pale golden. Remove parchment from sheets and cool meringue layers on it on racks. Carefully peel off parchment and put meringues, smooth sides up, on a work surface. Meringue layers may be made 1 day ahead and kept, wrapped well in plastic wrap, in a cool dry place.","In a heavy saucepan combine cranberries, preserves, sugar, water, and lemon juice and simmer until thickened slightly, 10 to 15 minutes. Cranberry sauce may be made 2 days ahead and chilled, covered.","In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Remove top of double boiler or bowl from heat and transfer chocolate to a sealable plastic bag. Seal bag, pressing out excess air. Squeeze chocolate to one corner and snip off corner as close to edge as possible to make a 1/8-inch hole. Drizzle chocolate over smooth sides of meringues (do not spread to coat) and chill, uncovered, until chocolate is set, about 30 minutes.","In a bowl beat cream with sugar and vanilla until cream holds stiff peaks.","Put 1 meringue layer, chocolate side down, on a cake plate and spread evenly with about half of whipped cream. Repeat layering in same manner with another meringue, remaining whipped cream, and remaining meringue. Dacquoise may be assembled and kept in a cake keeper, chilled, at least 8 hours and up to 2 days.","Garnish dacquoise with chocolate leaves and sugared cranberries, Slice dacquoise with a serrated knife and serve chilled with cranberry sauce.","In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth, and remove double boiler or pan from heat. With a 1/2-inch pastry brush coat underside of each leaf about 1/8 inch thick with chocolate. Chill leaves, chocolate sides up, until chocolate is set, about 30 minutes, and carefully peel off holly or lemon leaves. Chocolate leaves may be made 1 week ahead and kept frozen, in layers separated by wax paper in an airtight container lined with wax paper. Makes 15 chocolate leaves."],"source":"www.epicurious.com","tags":["Berry","Chocolate","Egg","Dessert","Bake","Christmas","Cranberry","Lemon","Almond","Vanilla","Winter","Honey","Gourmet"]},{"id":519631992,"name":"1985 Chicken Pie with Biscuit Crust","ingredients":["4 cups chicken broth","3 carrots, cut crosswise into 1/4-inch slices","3/4 pound red potatoes, quartered lengthwise and cut crosswise into 1/2-inch pieces","2 large ribs of celery, cut crosswise into 1/2-inch pieces","2 1/2 cups cubed cooked chicken (the meat from a 3-pound chicken)","1 onion, chopped","3/4 stick (6 tablespoons) unsalted butter","6 tablespoons all-purpose flour","1/4 teaspoon dried thyme, crumbled","1/4 teaspoon freshly grated nutmeg, or to taste","1/2 cup minced fresh parsley leaves","1 1/3 cups all-purpose flour","1 1/2 teaspoons double-acting baking powder","1/2 teaspoon baking soda","1/2 teaspoon salt","2 tablespoons cold unsalted butter, cut into bits","2 tablespoons cold vegetable shortening, cut into bits","1/3 cup grated sharp Cheddar","1 large egg","about 1/3 cup buttermilk","an egg wash made by beating 1 large egg yolk with 1 tablespoon milk"],"preparation":["In a saucepan bring the broth to a boil, add the carrots, the potatoes, and the celery, and simmer the vegetables, uncovered, for 10 to 15 minutes, or until they are tender. Transfer the vegetables with a slotted spoon to a large bowl, reserving the broth, and add the chicken to the bowl. In another saucepan cook the onion in the butter over moderately low heat, stirring, until it is softened, add the flour, and cook the roux, stirring, for 3 minutes. Add 3 cups of the reserved broth in a stream, whisking, reserving any remaining broth for another use, and bring the mixture to a boil, whisking. Add the thyme and simmer the sauce, stirring occasionally, for 5 minutes. Stir in the nutmeg, the parsley, and salt and pepper to taste, pour the sauce over the chicken mixture, and stir the mixture gently until it is just combined. Transfer the mixture to a 2-quart shallow baking dish or divide it among four 2-cup shallow baking dishes. The filling may be made 1 day in advance and kept covered and chilled. Bring the mixture to room temperature before continuing with the recipe.","Into a bowl sift together the flour, the baking powder, the baking soda, and the salt, add the butter and the shortening, and blend the mixture until it resembles meal. Add the Cheddar and toss the mixture. Into a liquid measuring cup break the egg, add enough of the buttermilk to measure a total of 1/2 cup, and beat the mixture with a fork. Add the egg mixture to the flour mixture, stirring until the mixture just forms a dough, gather the dough into a ball, and on a floured surface pat it out 1/2 inch thick. Cut out as many rounds as possible with a 2-inch fluted round cutter dipped in flour, gathering the scraps and patting the dough out again in the same manner.","Arrange the rounds on the chicken mixture, brush the tops of the rounds with the egg wash, and prick the rounds with a fork. Bake the pie in the middle of a preheated 450°F. oven for 15 to 25 minutes, or until the biscuits are puffed and golden and the filling is bubbling."],"source":"www.epicurious.com","tags":["Chicken","Potato","Bake","Winter","Chill","Simmer","Boil","Gourmet"]},{"id":3683661725,"name":"Indian Curried Barley Pilaf","ingredients":["¼ cup butter","1  onion, diced","1 ½ cups pearl barley","½ teaspoon ground allspice","½ teaspoon ground turmeric","¼ teaspoon curry powder","½ teaspoon salt","⅛ teaspoon ground black pepper","3 ½ cups chicken broth","¼ cup slivered almonds","¼ cup raisins (optional)"],"preparation":["Melt butter in a large skillet placed over medium-high heat.  Add the onion and barley; cook, stirring frequently, until the onion begins to soften, about 5 minutes.  Stir in the allspice, turmeric, curry powder, salt, and black pepper.  Pour in the chicken broth, and bring to a simmer.","Cover skillet with lid, and reduce heat to low; simmer until the barley is tender, about 30 to 40 minutes.  Fluff the pilaf with a fork, and gently stir in the slivered almonds and raisins."],"source":"allrecipes.com","tags":[]},{"id":1643132210,"name":"Aligot Gratin","ingredients":["1 3/4 pounds russet (baking) potatoes","3 tablespoons unsalted butter, softened","4 garlic cloves, minced","3/4 cup milk","1 pound fresh mozzarella cheese, chopped fine","2/3 cup chilled heavy cream","2 tablespoons drained bottled horseradish"],"preparation":["In a large saucepan combine potatoes with salted water to cover by 2 inches and simmer until very tender, about 50 minutes. Drain potatoes. Return potatoes to pan and heat over low heat, shaking pan, until dry. Cool potatoes until they can be handled.","Peel potatoes and force through a ricer or medium disk of a food mill into pan. Add butter, garlic, and milk and cook mixture over moderately low heat, beating constantly with a wooden spoon, until fluffy and heated through, about 2 minutes.","Add mozzarella and salt and pepper to taste and cook mixture, beating until cheese is melted and forms long elastic strands when lifted with spoon.","Divide aligot among 6 buttered 1-cup shallow gratin dishes or one 6-cup buttered gratin dish. Aligot may be prepared up to this point 1 day ahead and chilled, covered. Bring aligot to room temperature before proceeding with recipe.","Preheat broiler.","In a bowl with an electric mixer beat cream until it holds soft peaks and beat in horseradish and salt to taste. Spread horseradish cream over aligot and broil about 4 inches from heat until golden, about 1 minute."],"source":"www.epicurious.com","tags":["Milk/Cream","Mixer","Potato","Side","Broil","Casserole/Gratin","Horseradish","Mozzarella","Winter","Gourmet","Sugar Conscious","Vegetarian","Pescatarian","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added","Kosher"]},{"id":1707813503,"name":"4-3-2-1 Spice Rub","ingredients":["4 tablespoons kosher salt","3 tablespoons brown sugar","2 tablespoons sweet paprika","1 tablespoon cayenne pepper"],"preparation":["Makes enough spice rub for two whole chickens. Double or triple the recipe and use it all summer."],"source":"www.epicurious.com","tags":["Low Fat","Vegetarian","Quick & Easy","Spice","Vegan","Edible Gift","Paprika"]},{"id":3679620,"name":"Ice-Cream Bombes with Brandied Dried Cranberries and Cherries","ingredients":["six 7-ounce disposable translucent soft plastic cups*","6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped","about 2 1/4 cups super-premium vanilla ice cream, softened","about 1/2 cup creamy caramel sauce","6 tablespoons ground pecan praline","Accompaniment: brandied dried cranberries and cherries","Garnish: 12 pecan praline shards (reserved from praline recipe )","*available at supermarkets under store brand name"],"preparation":["With scissors carefully cut through rims of cups and cut evenly around each cup to create a 2 3/4-inch-deep cup.","In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth, and remove double boiler or pan from heat. With a small pastry brush, lightly coat insides of cups with chocolate just to cover and on a tray freeze cups, right side up, until chocolate is firm, about 3 minutes. Add more coats of chocolate in same manner until an 1/8-inch-thick chocolate coating is formed inside each cup.","Spoon about 2 heaping tablespoons ice cream into bottom of each cup, smoothing surface with the back of a long-handled small metal spoon. Freeze cups until firm, about 30 minutes. Top ice cream in each cup evenly with 1 heaping tablespoon caramel sauce and sprinkle evenly with 1 tablespoon ground praline. Freeze cups 15 minutes. Top praline in each cup with a scant 1/4 cup ice cream, filling just to rim and smoothing with a spatula. Freeze cups until ice cream is frozen hard, about 1 hour. Ice-cream bombes may be prepared up to this point 5 days ahead and kept frozen, covered, in plastic cups.","To unmold bombes, carefully tear rim of each cup and continue tearing to remove cup. Ice-cream bombes may be unmolded 4 hours ahead and kept frozen, wrapped in plastic wrap.","Arrange bombes, ice-cream sides down, on each of 6 dessert plates. Spoon brandied dried fruit over and around bombes and garnish with praline shards."],"source":"www.epicurious.com","tags":["Chocolate","Fruit","Nut","Dessert","Frozen Dessert","Cranberry","Cherry","Vanilla","Gourmet"]},{"id":30216865,"name":"Ah-So-Easy Ramen Peanut Pasta","ingredients":["1/3 cup peanut butter","3 tablespoons vegetable oil","3 tablespoons vinegar","2 tablespoons soy sauce","1 clove garlic, minced","1 teaspoon white sugar","1/4 teaspoon cayenne pepper, or to taste","4 (3 ounce) packages ramen noodle soup (seasoning packets reserved for another use)","1/2 small cucumber, peeled and cut into matchsticks","1 green onion, thinly sliced","1/4 cup chopped cilantro","2 tablespoons chopped salted peanuts"],"preparation":["Stir peanut butter, vegetable oil, vinegar, soy sauce, garlic, sugar, and cayenne pepper together in a bowl until smooth.","Bring a pot of water to a boil. Cook ramen noodles in boiling water until tender yet firm to the bit, about 3 minutes; drain and transfer noodles to a bowl. Pour peanut butter sauce over the noodles and toss to coat. Stir cucumber and green onion into the noodle mixture; garnish with cilantro and peanuts."],"source":"allrecipes.com","tags":[]},{"id":409042638,"name":"A+ Vegan Pancakes","ingredients":["2 cups spelt flour","2 cups oat flour","2 tablespoons baking powder","1/4 cup ground flaxseed meal","1/2 teaspoon salt","3 1/2 cups low-fat vanilla soy milk","1/4 cup applesauce","2 tablespoons agave nectar","1 1/2 tablespoons vanilla extract","2 cups blueberries"],"preparation":["Whisk spelt flour, oat flour, baking powder, flaxseed meal, and salt together in a large mixing bowl.","Stir soy milk, applesauce, agave nectar, and vanilla extract together in a separate bowl.","Form a well in the center of the flour mixture and pour soy milk mixture into the well. Stir until the ingredients are just moistened; set aside for 15 minutes.","Lightly oil and heat a griddle to medium heat.","Spoon batter onto hot griddle, sprinkle blueberries onto wet batter, and cook until bubbles form, 2 to 3 minutes. Flip and continue cooking until golden brown on both sides, about 3 minutes more."],"source":"allrecipes.com","tags":[]},{"id":930099701,"name":"3-Ingredient Blueberry Champagne Granita","ingredients":["1 cup sugar","1 (10-ounce) bag frozen blueberries","1 (750-ml) bottle sparkling wine"],"preparation":["Bring sugar, 1 cup blueberries, and 1 cup water to a boil in a small saucepan; cook, stirring, until sugar dissolves, about 5 minutes. Transfer blueberry syrup to a medium bowl set inside an ice bath and let cool.","Purée syrup and remaining blueberries in a food processor until smooth. Strain mixture through a fine-mesh sieve into a 13x9\" (or other 3-qt.) freezer-safe baking dish, pressing on solids to extract as much juice as possible; discard solids.","Pour sparkling wine into baking dish and stir to combine. Freeze mixture until just beginning to crystallize, about 2 hours. Scrape with a fork, then continue to freeze, scraping every hour, until texture is similar to shaved ice, 3–4 hours more. Cover with plastic wrap and keep frozen until ready to serve.","Granita can be made 5 days ahead; keep frozen."],"source":"www.epicurious.com","tags":["3-Ingredient Recipes","Dessert","Frozen Dessert","Blueberry","Champagne","Sparkling Wine"]},{"id":3959556454,"name":"Indian Sweet Coconut Dumplings","ingredients":["3/4 cup whole milk","1/2 cup grated dried unsweetened coconut","1/4 cup packed light brown sugar","2 tablespoons slivered almonds","2 tablespoons golden raisins","1/4teaspoon ground cardamom","About 24 dumpling or wonton wrappers","About 4 cups vegetable oil"],"preparation":["Simmer milk, coconut, brown sugar, almonds, raisins, and cardamom in a small skillet over medium heat, stirring, until liquid has evaporated. Cool.","Put a rounded teaspoon filling in center of a wrapper. Lightly brush edge of wrapper with water, then fold in half (diagonally if square) and press to seal. Form remaining dumplings.","Heat 1 inch oil to 350°F in a 12-inch skillet. Fry dumplings in 3 or 4 batches, turning once or twice, until golden- brown, 2 to 3 minutes per batch."],"source":"www.epicurious.com","tags":["Dessert","Kid-Friendly","Quick & Easy","Oscars","Raisin","Coconut","Almond","Pan-Fry","Gourmet","Kidney Friendly","Vegetarian","Pescatarian","Wheat/Gluten-Free","Peanut Free","Soy Free","Kosher"]},{"id":2859709543,"name":"A Gooey, Decadent Chocolate Cake","ingredients":["2 1/2 cups cake flour","1 1/2 teaspoons baking soda","1 teaspoon salt","1 1/2 sticks unsalted butter, at room temperature","2 cups granulated sugar","3 1/2 ounces dark chocolate, melted and cooled","1 teaspoon vanilla extract","2 eggs","1 1/2 cups cold water","Raspberry liqueur, such as Chambord, for drizzling","Nonstick cooking spray","Chocolate Chip Buttercream, recipe follows","Dark chocolate shavings, for decoration","3 cups powdered sugar","7 tablespoons hot water","4 ounces dark chocolate, melted and cooled","2 teaspoons vanilla extract","1/2 stick unsalted butter, at room temperature","1/4 cup semisweet dark chocolate, finely chopped"],"preparation":["Position an oven rack in the center of the oven and preheat the oven to 350 degrees F.","In a large bowl, sift together the flour, baking soda and salt; set aside. In the bowl of an electric mixer, cream the butter and granulated sugar until light and fluffy. Add the cooled chocolate and vanilla and beat for 3 minutes to incorporate. Beat in the eggs one at a time. Scrape down the sides of the bowl and beat for another 3 minutes. Gradually mix in the dry ingredients in three batches, alternating with the cold water. Beat for 1 minute after each addition to incorporate the ingredients. Mix until the batter is smooth.","Coat two 9-inch round cake pans with nonstick cooking spray. Cut 2 circles of parchment paper to fit the pan bottoms and place them inside the pans; then spray the paper for added non-stick insurance. Pour the batter into the prepared pans and smooth the surface with a spatula; the pans should be two-thirds full. Bake for 30 to 35 minutes. The cake is cooked when a toothpick inserted in the center comes out clean and the cake springs back when touched. Leave to cool for 40 minutes.","Turn the cakes out of the pans and remove the paper. Drizzle them with a few tablespoons of raspberry liqueur. With a metal spatula, spread 1/2 cup Chocolate Chip Buttercream on top of one of the layers. Start in the center and work your way out. Carefully place the second layer on top. Smooth the sides with buttercream, and then spread the rest over the top so that the cake is completely covered. Refrigerate for 5 minutes before decorating or cutting.","With a large knife, scrape some shavings from a block of dark chocolate. Scatter the shavings over the cake.","In the bowl of an electric mixer, dissolve the powdered sugar and water at low speed. Beat in the dark chocolate and vanilla. Add the butter gradually in small bits. Mix until everything is completely incorporated. Using a spatula, fold in the chopped chocolate and give a final quick spin."],"source":"www.foodnetwork.com","tags":["Chocolate Cake","Cake","Chocolate","Baking","Dessert","Mixer Recipes","Dairy Recipes","Fruit","Raspberry Recipes"]},{"id":3027257713,"name":"A Plus Carrot Cake","ingredients":["2 cups all-purpose flour","2 teaspoons baking powder","1 teaspoon baking soda","1/2 teaspoon salt","1 teaspoon ground cinnamon","1/2 teaspoon ground nutmeg","1/2 teaspoon allspice","4 eggs","2 cups white sugar","2 teaspoons vanilla extract","1 1/4 cups vegetable oil","2 cups grated carrots","1 (20 ounce) can crushed pineapple, drained","1/2 cup sweetened flaked coconut","1 cup chopped walnuts","1 cup raisins"],"preparation":["Preheat the oven to 350 degrees F (175 degrees C).  Coat a 10x15x2 inch baking dish or 10 inch Bundt pan with cooking spray.","In a medium bowl, stir together the flour, baking powder, baking soda, salt, cinnamon and nutmeg. Set aside. In a separate larger bowl, mix together the eggs, sugar and vanilla by hand. Stir in the oil; the mixture should resemble pudding. Gradually stir in the dry ingredients, then fold in the carrots, pineapple coconut, walnuts and raisins. Pour the batter into the prepared pan, and spread evenly.","Bake for 55 to 60 minutes in the preheated oven, or until a small knife inserted into the cake comes out clean."],"source":"allrecipes.com","tags":[]},{"id":966652062,"name":"Italian Rice Balls","ingredients":["2 tablespoons olive oil","5 cloves garlic, minced","1 medium onion, diced small","1 pound ground beef","1 pound ground veal","1 cup Italian flat-leaf parsley leaves, minced","2 tablespoons minced fresh thyme","1 tablespoon dried oregano","Kosher salt and ground black pepper","1/2 teaspoon cayenne pepper","1/2 teaspoon red pepper flakes","1 1/2 cups tomato sauce","2 cups cooked and cooled Arborio rice (cooked until just done, not overcooked)","2 cups grated Parmesan","Canola oil, for frying","5 eggs","3 cups breadcrumbs with Italian seasoning","Marinara Sauce, recipe follows, or store-bought","3 tablespoons minced fresh basil","1 tablespoon olive oil","1 onion, chopped","4 cloves garlic, minced","Three 28-ounce cans whole peeled tomatoes, including liquid","1 cup fresh basil leaves","1/2 cup fresh oregano leaves","1/2 cup fresh thyme leaves","2 teaspoons kosher salt","1/2 teaspoon ground black pepper"],"preparation":["Heat the olive oil in a large skillet over medium heat and saute the garlic and onions until softened, about 2 minutes. Add the meat and cook until browned, breaking up large pieces as it cooks. Strain off excess fat from the skillet. Add the parsley and cook, about 3 minutes. Add the thyme, oregano, 2 teaspoons salt, 1 teaspoon black pepper, cayenne and red pepper flakes. Taste and add more seasoning if needed. Keep in mind that rice and cheese contain salt so be careful not to over salt the meat mixture. Let the meat mixture cool a bit. Add the tomato sauce. Combine the rice with the cheese but be careful not to mash the rice. Add the rice mixture to the meat mixture and stir gently to combine. Check the seasonings. Add additional salt and pepper if necessary.","Line a baking sheet with parchment paper. Use a small to medium ice cream scoop (number 10) to shape the balls so they are a consistent size, and then hand roll the balls as tightly as you can.","Pour enough canola oil into a deep skillet or Dutch oven to reach 5 inches. Heat the oil over medium heat to 350 degrees F; use a deep-fry thermometer to check the oil temperature.","Whisk the eggs in a small baking dish. Place the breadcrumbs in another baking dish. Roll the rice balls lightly in the eggs and then immediately roll in the breadcrumbs to form a coating. Shake off the excess breadcrumbs. Place them on the prepared baking sheet and refrigerate or freeze until you are ready to fry.","To fry, carefully drop the rice balls into the hot oil, a few at a time, taking care not to overcrowd and lower the oil temperature. Cook until golden brown, 2 to 4 minutes per batch. Bring the oil back up to 350 degrees F before cooking each batch. Drain the rice balls on paper towels before serving.","Serve with Marinara Sauce for dipping. Garnish with the basil.","This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results.","Heat the olive oil in the bottom of a large pot. Add the onions and cook until translucent and softened, about 5 minutes. Add the garlic and cook for 1 minute. Use some of the liquid from the tomatoes to deglaze the pan, and then add the tomatoes, basil, oregano, thyme, salt and pepper. Use an immersion blender to puree, taking care to leave the tomatoes slightly chunky. (If you don't have an immersion blender, you can add everything to a blender or food processor.)","Bring to a boil and cook for 5 minutes, stirring frequently to keep from burning on the bottom. Reduce the heat to low and cook for 1 hour or longer so that the marinara thickens as some of the liquid cooks out. Check seasoning prior to serving. Add salt as necessary."],"source":"www.foodnetwork.com","tags":["Sauce Recipes","Rice Recipes","Tomato","Vegetable","Appetizer"]},{"id":2050050609,"name":"Vanilla-Bean Cheesecake with Guava Topping and Mango-Lime Salad","ingredients":["Nonstick vegetable oil spray","1 1/4 cups graham cracker crumbs","2 tablespoons sugar","1/4 cup (1/2 stick) unsalted butter, melted","3 8-ounce packages cream cheese, room temperature","1 cup sugar","2 vanilla beans, split lengthwise","4 large eggs","3/4 cup sour cream","2 tablespoons plus 1/2 cup water","1 envelope unflavored gelatin","1/2 cup sugar","2 cups guava nectar or guava juice","Mango-Lime Salad","Toasted sweetened flaked coconut"],"preparation":["Preheat oven to 350°F. Spray 8-inch-diameter springform pan with nonstick spray. Mix graham cracker crumbs and sugar in processor. Add melted butter; process until crumbs are evenly moistened. Press crumb mixture onto bottom (not sides) of prepared pan. Bake until crust is set and deep golden, about 12 minutes. Cool crust while making filling. Maintain oven temperature.","Using electric mixer, beat cream cheese in large bowl until smooth. Add sugar, then scrape in seeds from vanilla bean; beat until smooth. Add eggs 1 at a time, blending well after each addition. Beat in sour cream.","Pour filling over crust. Bake cake until puffed, golden on top, and set around edges, and center moves slightly when pan is gently shaken, about 1 hour (top may crack). Cool 30 minutes. Refrigerate uncovered overnight. Using back of spoon, smooth any cracks on top of cake.","Pour 2 tablespoons water into small bowl. Sprinkle gelatin over; let stand until gelatin softens, about 10 minutes. Bring sugar and remaining 1/2 cup water to boil in medium saucepan, stirring until sugar dissolves. Boil until reduced to 1/2 cup, about 3 minutes. Add guava nectar to sugar syrup; stir over medium-low heat just until mixture is hot. Add gelatin mixture and stir just until gelatin dissolves. Place in freezer until gelatin begins to thicken slightly but is still pourable, stirring occasionally, about 20 minutes. Spoon guava topping over cheesecake, spreading to edges of cake. Chill until topping sets, at least 8 hours or overnight.","Using small sharp knife, cut around sides of cake to loosen. Remove pan sides. Cut cake into wedges and transfer to plates. Spoon Mango-Lime Salad alongside. Sprinkle with toasted coconut."],"source":"www.epicurious.com","tags":["Cake","Fruit Juice","Egg","Dessert","Bake","Cream Cheese","Lime","Mango","Vanilla","Guava","Sour Cream","Peanut Free","Tree Nut Free","Soy Free"]},{"id":2252809488,"name":"Cucumber-Basil Agua Fresca","ingredients":["2 large English hothouse cucumbers","1/2 cup fresh lime juice","1/4 cup (packed) basil leaves","1/4 cup sugar or agave syrup, plus more to taste"],"preparation":["Slice a few thin slices of cucumber; reserve for garnish. Peel and coarsely chop remaining cucumber.","Purée chopped cucumber, lime juice, basil, 1/4 cup sugar, and 2 cups water in a food processor until very smooth. Strain into a pitcher and add 2 cups water, adding more sugar or water if needed, then chill until ready to serve. Add reserved cucumber slices just before serving."],"source":"www.epicurious.com","tags":["Non-Alcoholic","Kid-Friendly","Quick & Easy","Basil","Cucumber","Summer","Lime Juice","Drink"]},{"id":1353859705,"name":"Accras de Morue","ingredients":["1/2 pound skinless boneless salt cod, cut into 2-inch pieces and rinsed","1 cup all-purpose flour","1/4 cup milk","1 large egg","3/4 teaspoon double-acting baking powder","a rounded 1/4 teaspoon ground allspice","2 garlic cloves, minced","a 4-inch-long fresh hot red or green chili, seeded and minced (wear rubber gloves)","3 scallions, chopped fine","1 tablespoon finely chopped fresh coriander if desired","vegetable oil for deep-frying","sauce chien as an accompaniment (Caribbean Spicy Dipping Sauce)","1 small onion, minced","3 scallions, minced","1/3 cup minced red bell pepper","2 garlic cloves, minced","1 Scotch bonnet or habañero chili, seeded and minced (wear rubber gloves), or 1 teaspoon Scotch Bonnet Pepper Sauce*","1 teaspoon salt","1/4 teaspoon dried thyme, crumbled","7/8 cup water","2 tablespoons white-wine vinegar","1/4 cup fresh lime juice","2 tablespoons vegetables oil","2 tablespoons chopped fresh coriander, or to taste, plus a coriander sprigs for garnish if desired"],"preparation":["In a large bowl let the salt cod soak in enough cold water to cover it by 3 inches, changing the water several times, for an least 8 hours or overnight. Drain the salt cod well in a sieve and in a food processor purée it. Add the flour, the milk, the egg, the baking powder, the allspice, and the garlic and blend the mixture well. Transfer the mixture to a bowl and stir in the chili, the scallions, and the coriander. In a deep fryer or large deep skillet heat 1 1/2 inches of the oil to 360°F. on a deep-fat thermometer and in it fry teaspoons of the mixture in batches, stirring and turning them occasionally, for 1 to 2 minutes, or until they are golden and cooked through. Transfer the fritters as they are fried with a slotted spoon to paper towels to drain. The fritters may be made 2 days in advance and kept covered and chilled. Reheat the fritters on a rack in a shallow roasting pan in a preheated 450°F. oven for 5 minutes. Serve the fritters with the sauce.","In a heatproof bowl combine the onion, the scallions, the bell pepper, the garlic, the chili, the salt, and the thyme. In a small saucepan bring the water to a boil with the vinegar, pour the vinegar mixture over the vegetable mixture, and let the mixture cool. Stir in the lime juice and the oil. The sauce may be made 2 days in advance and kept covered and chilled. Let the sauce come to room temperature, stir in the chopped coriander, and garnish the sauce with the coriander sprigs. Makes about 2 cups."],"source":"www.epicurious.com","tags":["Pepper","Appetizer","Side","Fry","Cod","Gourmet"]},{"id":2842975251,"name":"Veggie Burgers With Zucchini and Corn","ingredients":["1 large onion","1 garlic clove, coarsely chopped","1/2 cup cornmeal","1 1/2  cups (packed) coarsely grated zucchini (from about 1 medium zucchini), squeezed to remove excess water,  divided","1/3  cup white beans, rinsed, divided","1/4 cup frozen corn (preferably fire-roasted) , thawed, divided","2 tablespoons vegetable oil, divided, plus more for brushing","3/4 cup cooked millet or white quinoa","1/2  cup finely chopped basil, divided","1  teaspoon kosher salt, divided","1 teaspoon freshly ground black pepper, divided","1/3 cup mayonnaise","1 1/2 teaspoons finely grated lime zest","1 1/2 teaspoons fresh lime juice","4 slices white cheddar","4 hamburger buns","Green leaf lettuce, (for serving)","1 avocado, cubed, lightly smashed"],"preparation":["Cut onion in half crosswise. Slice one-half into 1/4\" rings; set aside. Finely chop remaining onion. Pulse chopped onion, garlic, cornmeal, 3/4 cup zucchini, 2 Tbsp. beans, and 2 Tbsp. corn in a food processor until finely chopped, 30–45 seconds.","Heat 1 Tbsp. oil in a large skillet over medium. Add chopped onion mixture and cook, stirring occasionally, until mixture begins to soften and thicken, 3–4 minutes. Add remaining 3/4 cup zucchini and cook, stirring occasionally, until zucchini begins to soften and become translucent, 3–4 minutes more.","Transfer mixture to a large bowl and gently mix in millet, 1/4 cup basil, 3/4 tsp. salt, 3/4 tsp. pepper, and the remaining beans and corn until well combined. Form mixture into 4 (1\"-thick) patties. Cover with plastic and freeze 20 minutes.","Meanwhile, combine mayonnaise, lime zest, lime juice, and remaining 1/4 cup basil in a small bowl; set aside.","Prepare a grill for medium-high heat or heat a grill pan or cast-iron skillet over medium-high; oil grate or pan. Toss reserved onion rings with 1 Tbsp. oil and remaining 1/4 tsp. salt and 1/4 tsp. pepper. Cook onion rings until softened and lightly charred, about 5 minutes.","Brush patties all over with oil. Cook, flipping once, until medium brown and toasted, about 7 minutes on each side; add 1 slice cheese to each during last 3 minutes of cooking. Transfer onions and burgers to a plate. Toast buns until golden brown, about 30 seconds.","Place 1 piece lettuce on each bottom bun and top with a burger. Top with onions. Spread 1 Tbsp. basil mayonnaise on each top bun, add smashed avocado, and close sandwiches."],"source":"www.epicurious.com","tags":["Vegetarian","Vegan","Wheat/Gluten-Free","Zucchini","Corn","Bean","Grill","Back to School","No Meat, No Problem"]}]